In [1]:
import pandas as pd
from pandas import Series
from pandas import DataFrame

import numpy as np

# Series operation

In [3]:
s1=Series(range(1,6), index=list("abcef"))
s1

a    1
b    2
c    3
e    4
f    5
dtype: int32

In [6]:
s2=Series(range(5,11),index=list("bcedfg"))
s2

b     5
c     6
e     7
d     8
f     9
g    10
dtype: int32

넘파이에서는 두개 더할때 크기가 달랐으면 안됬지만 panda는 가능

index를 기준으로 연산을 수행한다.

In [7]:
s1.add(s2)

a     NaN
b     7.0
c     9.0
d     NaN
e    11.0
f    14.0
g     NaN
dtype: float64

인덱스가 같지 않은 곳(겹치지 않은 곳) 은 NaN으로 뜬다.

또 s1+s2도 같은 효과

In [11]:
s1+s2

a     NaN
b     7.0
c     9.0
d     NaN
e    11.0
f    14.0
g     NaN
dtype: float64

만약 빈곳에 NaN이 아니라 채우고 싶다면 fill_value를 사용하면된다.

빈곳을 0으로 채워보자

In [12]:
s1.add(s2,fill_value=0)

a     1.0
b     7.0
c     9.0
d     8.0
e    11.0
f    14.0
g    10.0
dtype: float64

# dataframe opertion

넘파이의 매트릭스와 유사하지만 column과 index를 모두 고려해야한다.

In [15]:
df1 = DataFrame(np.arange(9).reshape(3,3), columns=list("abc"))
df1

   a  b  c
0  0  1  2
1  3  4  5
2  6  7  8

In [14]:
df2 = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

크기가 다른애들 연산하면 빈 곳을 NaN으로 반환

In [16]:
df1 + df2

      a     b     c   d
0   0.0   2.0   4.0 NaN
1   7.0   9.0  11.0 NaN
2  14.0  16.0  18.0 NaN
3   NaN   NaN   NaN NaN

마찬가지로 fill value를 사용하면 빈곳도 채울 수 있음

In [17]:
df1.add(df2,fill_value=0)

      a     b     c     d
0   0.0   2.0   4.0   3.0
1   7.0   9.0  11.0   7.0
2  14.0  16.0  18.0  11.0
3  12.0  13.0  14.0  15.0

더하기(add) 외에도 빼기(sub), 나누기(div), 곱하기(mul) 등이 있음

# Series + Dataframe

In [18]:
df = DataFrame(np.arange(16).reshape(4,4), columns=list("abcd"))
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [19]:
s = Series(np.arange(10,14), index=list("abcd"))
s

a    10
b    11
c    12
d    13
dtype: int32

df + s를 하면 column을 기준으로 broadcasting이 자동적으로 발생함

10 11 12 13

10 11 12 13

10 11 12 13

10 11 12 13

을 더하는것과 같음

In [20]:
df + s

    a   b   c   d
0  10  12  14  16
1  14  16  18  20
2  18  20  22  24
3  22  24  26  28

다른 경우도 있음

In [21]:
s2 = Series(np.arange(10,14))
s2

0    10
1    11
2    12
3    13
dtype: int32

In [22]:
df

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [23]:
df + s2

    a   b   c   d   0   1   2   3
0 NaN NaN NaN NaN NaN NaN NaN NaN
1 NaN NaN NaN NaN NaN NaN NaN NaN
2 NaN NaN NaN NaN NaN NaN NaN NaN
3 NaN NaN NaN NaN NaN NaN NaN NaN

column값이 다르다보니 전부 NaN값이 뜸

aixs를 기준으로 row broadcasting을 실행해주면 된다.

In [24]:
df.add(s2, axis=0)

    a   b   c   d
0  10  11  12  13
1  15  16  17  18
2  20  21  22  23
3  25  26  27  28